# Pandas

> pip install pandas

In [2]:
import pandas as pd
import numpy as np

C:\Users\Administrator\AppData\Local\Temp\ipykernel_10444\2937650959.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

# Creating of the DataFrame

### 1. From Dictionary

In [2]:
data = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"]
}

# Create DataFrame
df = pd.DataFrame(data)

# Show the top 5x records
df.head()

   ID    name
0   1  Thomas
1   2    Ingo
2   3    Sara
3   4    Lena
4   5   Julia

In [3]:
data = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"],
    "city": "Berlin",  # same value for all rows
    "score": np.array([3,5,2,7,1]) # Numpy array
}


# Create DataFrame
df = pd.DataFrame(data)

# Show the top 5x records
df.head()

   ID    name    city  score
0   1  Thomas  Berlin      3
1   2    Ingo  Berlin      5
2   3    Sara  Berlin      2
3   4    Lena  Berlin      7
4   5   Julia  Berlin      1

In [4]:
data = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"],
    "city": "Berlin",  # same value for all rows
    "score": np.array([3,5,2,7,1]) # Numpy array
}


# Create DataFrame with different column order , or certain columns to be imported
df = pd.DataFrame(data, columns=["city",  "name"])

# Show the top 5x records
df.head()

     city    name
0  Berlin  Thomas
1  Berlin    Ingo
2  Berlin    Sara
3  Berlin    Lena
4  Berlin   Julia

## 2. From a list

In [5]:
my_list = [
    {"ID": 1, "name": "Thomas", "city": "Berlin"},
    {"ID": 2, "name": "Ingo", "city": "Berlin"},
    {"ID": 3, "name": "Sara", "city": "Berlin"}    
]

# Create a DataFrame
df = pd.DataFrame(my_list)

# Show the top 5x records
df.head()

   ID    name    city
0   1  Thomas  Berlin
1   2    Ingo  Berlin
2   3    Sara  Berlin

In [6]:
my_list = [
    [1, "Thomas", "Berlin"],
    [2, "Ingo", "Berlin"],
    [3, "Sara", "Berlin"],
]


df = pd.DataFrame(my_list, columns = ["SS", "AA", "BB"]) # Give  manual column names

# show top 5x rows
df.head()

   SS      AA      BB
0   1  Thomas  Berlin
1   2    Ingo  Berlin
2   3    Sara  Berlin

## 3. From JSON

In [7]:
data = {
    "AAAA" : {
        "11": 100,
        "12": 101,
        "23": 102,
    },
    "BBB": {
        "11": "Thomas",
        "12": "Ingo",
        "23" : "Lena",
    }
}

df = pd.DataFrame(data)

df.head()

    AAAA     BBB
11   100  Thomas
12   101    Ingo
23   102    Lena

# Indexing

Index: can have duplicates

In [8]:
data = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"],
    "city": "Berlin",  # same value for all rows
    "score": np.array([3,5,2,7,1]) # Numpy array
}




# Create DataFrame
df = pd.DataFrame(data, index = ["a", "b", "c", "d", "e"]) # give custom indexing

df.head()

   ID    name    city  score
a   1  Thomas  Berlin      3
b   2    Ingo  Berlin      5
c   3    Sara  Berlin      2
d   4    Lena  Berlin      7
e   5   Julia  Berlin      1

In [9]:
# After creating the DataFrame --> Speciify the index column

df2 = df.set_index("name")

df2.head()

        ID    city  score
name
Thomas   1  Berlin      3
Ingo     2  Berlin      5
Sara     3  Berlin      2
Lena     4  Berlin      7
Julia    5  Berlin      1

# Create DataFrame from external files

In [10]:
df = pd.read_csv("./my_data.csv")
# df = pd.read_csv("./my_data.csv", delimiter=";")
# df = pd.read_csv("./my_data.csv", delimiter="\t")

df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [11]:
# use specific column from csv file
df = pd.read_csv("./my_data.csv", index_col = 0) # 0: is the order of the column
df = pd.read_csv("./my_data.csv", index_col = "Product") # "product": is the column name of the wished index

df.head()

,Order ID,Quantity Ordered,Price Each,Order Date,Purchase Address
Product,,,,,
USB-C Charging Cable,176558,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
NaN,NaN,NaN,NaN,NaN,NaN
Bose SoundSport Headphones,176559,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
Google Phone,176560,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
Wired Headphones,176560,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [12]:
# After creating the dataframe --> change the index column
df2 = df.set_index("Order Date")
df2.head()

,Order ID,Quantity Ordered,Price Each,Purchase Address
Order Date,,,,
04/19/19 08:46,176558,2,11.95,"917 1st St, Dallas, TX 75001"
NaN,NaN,NaN,NaN,NaN
04/07/19 22:30,176559,1,99.99,"682 Chestnut St, Boston, MA 02215"
04/12/19 14:38,176560,1,600,"669 Spruce St, Los Angeles, CA 90001"
04/12/19 14:38,176560,1,11.99,"669 Spruce St, Los Angeles, CA 90001"

In [13]:
# Use Specific Column Names for my DataFrame

df = pd.read_csv("./my_data.csv", names= ("A", "B", "C", "D", "E", "F"))

df.head()

,A,B,C,D,E,F
0,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
1,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
2,NaN,NaN,NaN,NaN,NaN,NaN
3,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
4,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [57]:
# Read only some columns
df = pd.read_csv("./my_data.csv", usecols = ["Order ID", "Product", "Price Each"])

df.head()

FileNotFoundError: [Errno 2] No such file or directory: './my_data.csv'

# DataFrame Informaiton

In [15]:
df = pd.read_csv("./my_data.csv")

# Show Rows

In [16]:
df.head() # top 5x records
df.head(2) # top 2x records


df.tail() # Show the last 5x records
df.tail(3) # show the last 3x records


df.sample() # random 1x record
df.sample(3) # random 3x records

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
40715,305510,Bose SoundSport Headphones,1,99.99,12/04/19 15:26,"16 Hill St, Atlanta, GA 30301"
186683,259203,AAA Batteries (4-pack),1,2.99,09/02/19 16:16,"353 North St, San Francisco, CA 94016"
59033,153860,Bose SoundSport Headphones,1,99.99,02/27/19 22:56,"632 South St, Austin, TX 73301"

In [17]:
""" 
- columns and datatypes
- count of rows (total)
- columns and non-null values
"""
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 186850 entries, 0 to 186849
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          186305 non-null  object
 1   Product           186305 non-null  object
 2   Quantity Ordered  186305 non-null  object
 3   Price Each        186305 non-null  object
 4   Order Date        186305 non-null  object
 5   Purchase Address  186305 non-null  object
dtypes: object(6)
memory usage: 8.6+ MB

In [18]:
df.dtypes

Order ID            object
Product             object
Quantity Ordered    object
Price Each          object
Order Date          object
Purchase Address    object
dtype: object

In [19]:
df.shape  # (row_count, column_count)

df.shape[0] # count of rows
df.shape[1] # count of columns

6

In [20]:
row_count, col_count = df.shape


print(row_count)
print(col_count)

186850
6

In [21]:
df.size # counf ot items ---> Achtung : only for non-null Values

1121100

# Show columns

In [22]:
df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,USB-C Charging Cable,2,11.95,04/19/19 08:46,"917 1st St, Dallas, TX 75001"
1,NaN,NaN,NaN,NaN,NaN,NaN
2,176559,Bose SoundSport Headphones,1,99.99,04/07/19 22:30,"682 Chestnut St, Boston, MA 02215"
3,176560,Google Phone,1,600,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"
4,176560,Wired Headphones,1,11.99,04/12/19 14:38,"669 Spruce St, Los Angeles, CA 90001"

In [23]:
df["Product"]
df[ ["Product", "Price Each"]  ] # show Multi Columns

# Alternative --> onlny for columns names without spaces
df.Product

0               USB-C Charging Cable
1                                NaN
2         Bose SoundSport Headphones
3                       Google Phone
4                   Wired Headphones
                     ...
186845        AAA Batteries (4-pack)
186846                        iPhone
186847                        iPhone
186848        34in Ultrawide Monitor
186849          USB-C Charging Cable
Name: Product, Length: 186850, dtype: object

# Info about columns

In [24]:
# Unique values
print(df["Product"].unique()) # Get the unique values as an array including NaN

print(len(df["Product"].unique())) # 21x including None value

print(df["Product"].nunique()) # 20x returns the number of unique values without NAN/Null value

['USB-C Charging Cable' nan 'Bose SoundSport Headphones' 'Google Phone'
 'Wired Headphones' 'Macbook Pro Laptop' 'Lightning Charging Cable'
 '27in 4K Gaming Monitor' 'AA Batteries (4-pack)'
 'Apple Airpods Headphones' 'AAA Batteries (4-pack)' 'iPhone'
 'Flatscreen TV' '27in FHD Monitor' '20in Monitor' 'LG Dryer'
 'ThinkPad Laptop' 'Vareebadd Phone' 'LG Washing Machine'
 '34in Ultrawide Monitor' 'Product']
21
20

In [56]:
# Count
df["Product"].value_counts() # returns a Serie containting count of unique values and the number of records

#df["Product"].count()# Count of EXISTING values (without NAN)

KeyError: 'Product'

In [26]:
# Checks
df["Product"].isnull() # for each row --> give True or False

df["Product"].isnull().sum() # if (True = 1) --> Sum all Trues , Sum all 1

545

In [27]:
df["Product"].is_unique # False
df["Order ID"].is_unique # False

False

## Exercise

Get unique values for each column and save it into a text file

In [28]:
# your code

# Filter the Data

In [29]:
data = {
    "ID": [1,2,3,4,5],
    "name": ["Thomas", "Ingo", "Sara", "Lena", "Julia"],
    "city": "Berlin",  # same value for all rows
    "score": np.array([3,5,2,7,1]) # Numpy array
}


# Create DataFrame
df = pd.DataFrame(data)

df.head()

   ID    name    city  score
0   1  Thomas  Berlin      3
1   2    Ingo  Berlin      5
2   3    Sara  Berlin      2
3   4    Lena  Berlin      7
4   5   Julia  Berlin      1

In [30]:
df["name"] == "Thomas"

0     True
1    False
2    False
3    False
4    False
Name: name, dtype: bool

In [31]:
df[   df["name"] == "Thomas"  ]

   ID    name    city  score
0   1  Thomas  Berlin      3

In [32]:
df[   df["city"] == "Berlin"  ]

   ID    name    city  score
0   1  Thomas  Berlin      3
1   2    Ingo  Berlin      5
2   3    Sara  Berlin      2
3   4    Lena  Berlin      7
4   5   Julia  Berlin      1

In [33]:
df[   df["city"] == "Aachen"  ]

Empty DataFrame
Columns: [ID, name, city, score]
Index: []

In [34]:
df.loc[ df["name"] == "Thomas"    ]

   ID    name    city  score
0   1  Thomas  Berlin      3

In [35]:
# Combine multiple-conditions
df.loc[(df["name"] == "Thomas")    &   (df["city"] == "Berlin")] # and
df.loc[(df["name"] == "Thomas")    |   (df["city"] == "Berlin")] # or

   ID    name    city  score
0   1  Thomas  Berlin      3
1   2    Ingo  Berlin      5
2   3    Sara  Berlin      2
3   4    Lena  Berlin      7
4   5   Julia  Berlin      1

# Loop over the dataframe

In [36]:
# Loop over the columns
for column in df:
    print(column)

ID
name
city
score

In [37]:
# loop over the rows
for index, row in df.iterrows():
    print(index)
    print(row) # columns name and value
    print()

0
ID            1
name     Thomas
city     Berlin
score         3
Name: 0, dtype: object

1
ID            2
name       Ingo
city     Berlin
score         5
Name: 1, dtype: object

2
ID            3
name       Sara
city     Berlin
score         2
Name: 2, dtype: object

3
ID            4
name       Lena
city     Berlin
score         7
Name: 3, dtype: object

4
ID            5
name      Julia
city     Berlin
score         1
Name: 4, dtype: object

In [38]:
# loop over the rows
for index, row in df.iterrows():
    print(index)
    print(row.values) # [1 'Thomas' 'Berlin' 3] without column names
    print()

0
[1 'Thomas' 'Berlin' 3]

1
[2 'Ingo' 'Berlin' 5]

2
[3 'Sara' 'Berlin' 2]

3
[4 'Lena' 'Berlin' 7]

4
[5 'Julia' 'Berlin' 1]

# Sorting

In [39]:
df.head()

   ID    name    city  score
0   1  Thomas  Berlin      3
1   2    Ingo  Berlin      5
2   3    Sara  Berlin      2
3   4    Lena  Berlin      7
4   5   Julia  Berlin      1

In [40]:
df = df.sort_values("name")

In [41]:
df_sorted = df.sort_values("name", ascending = False)
df_sorted.head()

   ID    name    city  score
0   1  Thomas  Berlin      3
2   3    Sara  Berlin      2
3   4    Lena  Berlin      7
4   5   Julia  Berlin      1
1   2    Ingo  Berlin      5

In [42]:
# Sort by Index
df = df.sort_index()
df.sort_index(inplace=True)

df.head()

   ID    name    city  score
0   1  Thomas  Berlin      3
1   2    Ingo  Berlin      5
2   3    Sara  Berlin      2
3   4    Lena  Berlin      7
4   5   Julia  Berlin      1

# Concatenate several dataFrames

In [43]:
data1 = {
    "ID": [1,2],
    "name": ["Thomas", "Ingo"],
    "city" : "Berlin" # same value for all rows
}

data2 = {
    "ID": [3,4],
    "name": ["Julia", "Lena"],
    "city" : "Aachen" # same value for all rows
}

data3 = {
    "ID": [5,6,7],
    "name": ["Frank", "Mattias", "Alex"],
    "city" : "Frankfurt" # same value for all rows
}



df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df3= pd.DataFrame(data3)

In [44]:
df = pd.concat( [df1, df2, df3] )

df.head(6)

   ID     name       city
0   1   Thomas     Berlin
1   2     Ingo     Berlin
0   3    Julia     Aachen
1   4     Lena     Aachen
0   5    Frank  Frankfurt
1   6  Mattias  Frankfurt

In [45]:
df = pd.concat( [df1, df2, df3], axis = 1 ) # next to each other
df.head(6)


df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      2 non-null      float64
 1   name    2 non-null      object
 2   city    2 non-null      object
 3   ID      2 non-null      float64
 4   name    2 non-null      object
 5   city    2 non-null      object
 6   ID      3 non-null      int64
 7   name    3 non-null      object
 8   city    3 non-null      object
dtypes: float64(2), int64(1), object(6)
memory usage: 348.0+ bytes

# Data Types

In [46]:
data = {
    "ID": ["1","2","3"],
    "name": ["Thomas", "Ingo", "Sara"],
    "score": ["12.2", "13.3", "14.4"]
}

df = pd.DataFrame(data)

df.head()

  ID    name score
0  1  Thomas  12.2
1  2    Ingo  13.3
2  3    Sara  14.4

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      3 non-null      object
 1   name    3 non-null      object
 2   score   3 non-null      object
dtypes: object(3)
memory usage: 204.0+ bytes

In [48]:
df.describe()

       ID    name score
count   3       3     3
unique  3       3     3
top     1  Thomas  12.2
freq    1       1     1

In [49]:
# Manual Custom
df["ID"] = df["ID"].astype(int)
df["score"] = df["score"].astype(float)

In [50]:
# Alternative
#~~~~~~~~~~~~~

df["ID"] = pd.to_numeric(df["ID"])
df["score"] = pd.to_numeric(df["score"])

# Save to _CSV File

In [51]:
df.to_csv("output.csv") # with index column
df.to_csv("output.csv", index = False) # without index column
df.to_csv("output.csv", index = False, sep = ";") # without index column , with ; instead of comma

# Drop

In [52]:
data = {
    "ID": [1,2,3,4,5,6,7],
    "name" : ["Thomas", "Ingo", "Sara", "Lena", "Julia", "Frank", "Matthias"],
    "city": "Berlin"
}

df = pd.DataFrame(data)


df.head()

   ID    name    city
0   1  Thomas  Berlin
1   2    Ingo  Berlin
2   3    Sara  Berlin
3   4    Lena  Berlin
4   5   Julia  Berlin

In [53]:
# Drop Columns 
df.drop(columns = ["ID"])
df.drop(columns = ["ID", "name"])

     city
0  Berlin
1  Berlin
2  Berlin
3  Berlin
4  Berlin
5  Berlin
6  Berlin

In [54]:
df.drop(index = [1, 3])

   ID      name    city
0   1    Thomas  Berlin
2   3      Sara  Berlin
4   5     Julia  Berlin
5   6     Frank  Berlin
6   7  Matthias  Berlin

In [55]:
# index = 900 does not exists --> will throw and error --> "ingore" will ingore the error
df.drop(index = [1, 3, 900], errors ="ignore")

   ID      name    city
0   1    Thomas  Berlin
2   3      Sara  Berlin
4   5     Julia  Berlin
5   6     Frank  Berlin
6   7  Matthias  Berlin

# DropNA

In [56]:
import numpy as np

In [57]:
data = {
    "ID": [1, np.nan,np.nan ,np.nan,5,6,np.nan],
    "name": [np.nan, "Ingo", np.nan, "Lena", "Julia", "Frank", np.nan],
    "city": np.nan
}


df = pd.DataFrame(data)

df.head()

    ID   name  city
0  1.0    NaN   NaN
1  NaN   Ingo   NaN
2  NaN    NaN   NaN
3  NaN   Lena   NaN
4  5.0  Julia   NaN

In [58]:
df.dropna(axis = "columns", how ="all")  # -> same like 'city' column

    ID   name
0  1.0    NaN
1  NaN   Ingo
2  NaN    NaN
3  NaN   Lena
4  5.0  Julia
5  6.0  Frank
6  NaN    NaN

In [59]:
df.dropna(axis = "columns", how ="any")  # -> same like all columns

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [60]:
df.dropna(axis = "rows", how ="all")

    ID   name  city
0  1.0    NaN   NaN
1  NaN   Ingo   NaN
3  NaN   Lena   NaN
4  5.0  Julia   NaN
5  6.0  Frank   NaN

In [61]:
# consider only specific columns
df.dropna(axis = "rows", how ="all", subset =["name", "ID"])

    ID   name  city
0  1.0    NaN   NaN
1  NaN   Ingo   NaN
3  NaN   Lena   NaN
4  5.0  Julia   NaN
5  6.0  Frank   NaN

# FillNA

In [62]:
data = {
    "ID": [1, np.nan,np.nan ,np.nan,5,6,np.nan],
    "name": [np.nan, "Ingo", np.nan, "Lena", "Julia", "Frank", np.nan],
    "city": np.nan
}


df = pd.DataFrame(data)

df.head()

    ID   name  city
0  1.0    NaN   NaN
1  NaN   Ingo   NaN
2  NaN    NaN   NaN
3  NaN   Lena   NaN
4  5.0  Julia   NaN

In [63]:
# fill with specific value
df.fillna(0)

    ID   name  city
0  1.0      0   0.0
1  0.0   Ingo   0.0
2  0.0      0   0.0
3  0.0   Lena   0.0
4  5.0  Julia   0.0
5  6.0  Frank   0.0
6  0.0      0   0.0

In [64]:
# fill each colum with specific value
df.fillna({
    "ID": 999,
    "name" : "Not found",
    "city": "Berlin"

})

      ID       name    city
0    1.0  Not found  Berlin
1  999.0       Ingo  Berlin
2  999.0  Not found  Berlin
3  999.0       Lena  Berlin
4    5.0      Julia  Berlin
5    6.0      Frank  Berlin
6  999.0  Not found  Berlin

In [65]:
df.head()

    ID   name  city
0  1.0    NaN   NaN
1  NaN   Ingo   NaN
2  NaN    NaN   NaN
3  NaN   Lena   NaN
4  5.0  Julia   NaN

In [66]:
df.fillna(method = "ffill") # ffill: forward fill
df.fillna(method = "bfill") # bfill: backward fill

# columnwise
df.fillna(method = "bfill", axis = "columns") # bfill: backward fill
df.fillna(method = "ffill", axis = "columns") # ffill: forward fill

C:\Users\MD\AppData\Local\Temp\ipykernel_29032\4185188415.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "ffill") # ffill: forward fill
C:\Users\MD\AppData\Local\Temp\ipykernel_29032\4185188415.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "bfill") # bfill: backward fill
C:\Users\MD\AppData\Local\Temp\ipykernel_29032\4185188415.py:5: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "bfill", axis = "columns") # bfill: backward fill
C:\Users\MD\AppData\Local\Temp\ipykernel_29032\4185188415.py:5: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.fillna(method = "bfill", axis = "columns") # bfill: backward fill
C:\Users\MD\AppData\Local\Temp\ipykernel_29032\4185188415.py:6: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = "ffill", axis = "columns") # ffill: forward fill
C:\Users\MD\AppData\Local\Temp\ipykernel_29032\4185188415.py:6: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.fillna(method = "ffill", axis = "columns") # ffill: forward fill

    ID   name   city
0  1.0    1.0    1.0
1  NaN   Ingo   Ingo
2  NaN    NaN    NaN
3  NaN   Lena   Lena
4  5.0  Julia  Julia
5  6.0  Frank  Frank
6  NaN    NaN    NaN

# Example of filling values

In [67]:
data = {
    "ID": [1, np.nan, 2, np.nan, 3,4,5],
    "name": ["Thomas", "Thomas", "Ingo",np.nan , "Sara", "Julia","Thomas"],
    "score" : [25,np.nan , np.nan, 14, 64,21,14]
}

df = pd.DataFrame(data)


df.head()

    ID    name  score
0  1.0  Thomas   25.0
1  NaN  Thomas    NaN
2  2.0    Ingo    NaN
3  NaN     NaN   14.0
4  3.0    Sara   64.0

In [68]:
df["ID"] = df["ID"].interpolate() # Achtung: macht kein Sinn für Interpolation --> only a demo

# Get the most freq name
most_freq_name = df["name"].mode()[0]

# Get tthe mean of the score
mean_score = df["score"].mean()


df.fillna({
    "name": most_freq_name,
    "score" : mean_score
})

    ID    name  score
0  1.0  Thomas   25.0
1  1.5  Thomas   27.6
2  2.0    Ingo   27.6
3  2.5  Thomas   14.0
4  3.0    Sara   64.0
5  4.0   Julia   21.0
6  5.0  Thomas   14.0

# Duplicate

In [69]:
data = {
    "ID": [1,2, 2, 4, 4],
    "name" : ["Thomas", "Ingo", "Ingo", "Lena", "Lena"]
    
}

df = pd.DataFrame(data)

df.head()

   ID    name
0   1  Thomas
1   2    Ingo
2   2    Ingo
3   4    Lena
4   4    Lena

In [70]:
df.duplicated()
df.duplicated(keep = "first") # default
df.duplicated(keep = "last") # not-default

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [71]:
df.loc[df.duplicated() ]

   ID  name
2   2  Ingo
4   4  Lena

# drop_duplicates()

In [72]:
data = {
    "ID": [1,2, 2, 4, 4],
    "name" : ["Thomas", "Ingo", "Ingo", "Lena", "Lena"]
    
}

df = pd.DataFrame(data)

df.head()

   ID    name
0   1  Thomas
1   2    Ingo
2   2    Ingo
3   4    Lena
4   4    Lena

In [73]:
df.drop_duplicates() # with keep = first default
df.drop_duplicates(keep = "last") 
df.drop_duplicates(subset = ["name", "ID"]) # only consider these columns to drop the duplicates

   ID    name
0   1  Thomas
1   2    Ingo
3   4    Lena

# Pandas String

In [4]:
df = pd.DataFrame({
    "ID": [1,2,3,4],
    "name": ["thomas meier", "ali Meier   ", "   ingo mEier Möller", " Steffi"],
    "score" : [80,51,63,42]
})

df.head()

   ID                  name  score
0   1          thomas meier     80
1   2          ali Meier        51
2   3     ingo mEier Möller     63
3   4                Steffi     42

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      4 non-null      int64
 1   name    4 non-null      object
 2   score   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [10]:
df.name.str.title()
df.name.str.upper()
df.name.str.lower()
df.name.str.capitalize()
df.name.str.strip()

0         thomas meier
1            ali Meier
2    ingo mEier Möller
3               Steffi
Name: name, dtype: object

In [24]:
df.name.str.title()
df.name.str.upper()
df.name.str.lower()
df.name.str.capitalize()
df.name.str.strip()

# startswith()
df.name.str.startswith("t")
df[ df.name.str.startswith("t") ]
# 
 # replace
df.name.str.replace("Me", "KK")
# 
# # split 
df.name.str.split()
df.name.str.split(expand= True) # each splitted word will be separate in an own column

 # contains
df.name.str.contains("M|m") # small m or capital M
df[df.name.str.contains("M|m") ]
df.loc[df.name.str.contains("M|m") ]
 
 
 # len 
df.name.str.len() > 10
df[ df.name.str.len() > 10 ]

   ID                  name  score
0   1          thomas meier     80
1   2          ali Meier        51
2   3     ingo mEier Möller     63

# Merging (Joining) several dataframes

In [28]:
df1 = pd.DataFrame({'A': [1,2], 'B': [3,4]})
df2 = pd.DataFrame({'A': [3], 'C':[5]})
result = df1.merge(df2 , how='outer', on='A')
print(result)

   A    B    C
0  1  3.0  NaN
1  2  4.0  NaN
2  3  NaN  5.0

In [11]:
cities = {
    "city_code" : ["FFM", "AA", "BO", "STD"],
    "city_name" : ["Frankfurt am Main", "Aachen", "Bonn", "Stuttgart"]
}

data_emp = {
    "ID": [1,2,3,4],
    "name": ["Thomas", "Ingo", "Sara", "Lena"],
    "city_code" : ["FFM", "AA", "BO", "MU"], 

}

df_cities = pd.DataFrame(cities)
df_emp = pd.DataFrame(data_emp)


df_cities.head()
df_emp.head()

   ID    name city_code
0   1  Thomas       FFM
1   2    Ingo        AA
2   3    Sara        BO
3   4    Lena        MU

In [78]:
# Merge the two tables
df_emp.merge(df_cities, how = "inner", left_on = "city_code", right_on = "city_code")

   ID    name city_code          city_name
0   1  Thomas       FFM  Frankfurt am Main
1   2    Ingo        AA             Aachen
2   3    Sara        BO               Bonn

In [79]:
# Merge the two tables
df_emp.merge(df_cities, how = "left", left_on = "city_code", right_on = "city_code")

   ID    name city_code          city_name
0   1  Thomas       FFM  Frankfurt am Main
1   2    Ingo        AA             Aachen
2   3    Sara        BO               Bonn
3   4    Lena        MU                NaN

In [80]:
# Merge the two tables
df_emp.merge(df_cities, how = "right", left_on = "city_code", right_on = "city_code")

    ID    name city_code          city_name
0  1.0  Thomas       FFM  Frankfurt am Main
1  2.0    Ingo        AA             Aachen
2  3.0    Sara        BO               Bonn
3  NaN     NaN       STD          Stuttgart

# Group by

In [30]:
participants = [
    (10, "Thomas", 40, "Berlin", 70),
    (11, "Ingo", 40, "Berlin", 80),
    (12, "Sara", 40, "Berlin", 90),
    (13, "Lena", 40, "Frankfurt", 71),
    (14, "Julia", 40, "Frankfurt", 72),
    (15, "Frank", 40, "Frankfurt", 73),
    (16, "Matthias", 40, "Aachen", 75),
    (17, "Ali", 40, "Aachen", 76),
    (18, "Ahmed", 40, "Aachen", 77),
    (19, "Sabine", 40, "Stuttgart", 78),
    (20, "Steffi", 40, "Stuttgart", 79),
]

df = pd.DataFrame(participants, columns = ["ID", "name", "age", "city", "score"])

df = df.set_index("ID")

df.head(20)

        name  age       city  score
ID
10    Thomas   40     Berlin     70
11      Ingo   40     Berlin     80
12      Sara   40     Berlin     90
13      Lena   40  Frankfurt     71
14     Julia   40  Frankfurt     72
15     Frank   40  Frankfurt     73
16  Matthias   40     Aachen     75
17       Ali   40     Aachen     76
18     Ahmed   40     Aachen     77
19    Sabine   40  Stuttgart     78
20    Steffi   40  Stuttgart     79

In [33]:
groups = df.groupby("city") # creates 3x groups
for group_name in groups:
    print( group_name)

('Aachen',         name  age    city  score
ID
16  Matthias   40  Aachen     75
17       Ali   40  Aachen     76
18     Ahmed   40  Aachen     77)
('Berlin',       name  age    city  score
ID
10  Thomas   40  Berlin     70
11    Ingo   40  Berlin     80
12    Sara   40  Berlin     90)
('Frankfurt',      name  age       city  score
ID
13   Lena   40  Frankfurt     71
14  Julia   40  Frankfurt     72
15  Frank   40  Frankfurt     73)
('Stuttgart',       name  age       city  score
ID
19  Sabine   40  Stuttgart     78
20  Steffi   40  Stuttgart     79)

In [83]:
# loop over the groups

for group_name, rows in groups:
    print("Group name:", group_name)
    print("Rows:")
    print(rows, "\n")

Group name: Aachen
Rows:
        name  age    city  score
ID
16  Matthias   40  Aachen     75
17       Ali   40  Aachen     76
18     Ahmed   40  Aachen     77

Group name: Berlin
Rows:
      name  age    city  score
ID
10  Thomas   40  Berlin     70
11    Ingo   40  Berlin     80
12    Sara   40  Berlin     90

Group name: Frankfurt
Rows:
     name  age       city  score
ID
13   Lena   40  Frankfurt     71
14  Julia   40  Frankfurt     72
15  Frank   40  Frankfurt     73

Group name: Stuttgart
Rows:
      name  age       city  score
ID
19  Sabine   40  Stuttgart     78
20  Steffi   40  Stuttgart     79

In [84]:
# Get the count of rows for each group
groups.size()

city
Aachen       3
Berlin       3
Frankfurt    3
Stuttgart    2
dtype: int64

In [85]:
# Get a certain group
group_aachen = groups.get_group("Aachen")

group_aachen

        name  age    city  score
ID
16  Matthias   40  Aachen     75
17       Ali   40  Aachen     76
18     Ahmed   40  Aachen     77

In [34]:
mean_values = groups.mean(numeric_only = True)
mean_values

            age  score
city
Aachen     40.0   76.0
Berlin     40.0   80.0
Frankfurt  40.0   72.0
Stuttgart  40.0   78.5

In [87]:
results = groups.agg({
    "age" : "mean",
    "score" : "sum"
}) 

results

            age  score
city
Aachen     40.0    228
Berlin     40.0    240
Frankfurt  40.0    216
Stuttgart  40.0    157

In [36]:
results = groups["age"].agg(["sum", "mean" , "max"])

results = groups[["age", "score"]].agg(["sum", "mean" , "max"])

results

           age           score
           sum  mean max   sum  mean max
city
Aachen     120  40.0  40   228  76.0  77
Berlin     120  40.0  40   240  80.0  90
Frankfurt  120  40.0  40   216  72.0  73
Stuttgart   80  40.0  40   157  78.5  79

In [89]:
def success_status(scores):
    result = scores.mean()
    return "bestanden" if result >= 75 else "durchgefallen"

results = groups["score"].agg(["min", "mean", "max", success_status])

results

           min  mean  max success_status
city
Aachen      75  76.0   77      bestanden
Berlin      70  80.0   90      bestanden
Frankfurt   71  72.0   73  durchgefallen
Stuttgart   78  78.5   79      bestanden

# Datetime in pandas

In [17]:
# MM/DD

df = pd.DataFrame({
    "date":["03/15/2023","a/16/2023","03/17/2023"],
    "score": [30,35,21]
})

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   score   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [20]:
df["date"] = pd.to_datetime(df["date"], errors  ="ignore")
df["date"] = pd.to_datetime(df["date"], errors  ="coerce") # coerce: force the invalid values to NAT
df.head()

C:\Users\Administrator\AppData\Local\Temp\ipykernel_10444\3526074525.py:1: FutureWarning: errors='ignore' is deprecated and will raise in a future version. Use to_datetime without passing `errors` and catch exceptions explicitly instead
  df["date"] = pd.to_datetime(df["date"], errors  ="ignore")

        date  score
0 2023-03-15     30
1        NaT     35
2 2023-03-17     21

# Datetime Attributes

In [40]:
# Create DaTaFrame
df = pd.DataFrame({
    "date":["03/15/2023","03/16/2023","03/17/2023"],
    "score": [30,35,21]
})


# Convert
df["date"] =  pd.to_datetime(df["date"])

df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      datetime64[ns]
 1   score   3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 180.0 bytes

        date  score
0 2023-03-15     30
1 2023-03-16     35
2 2023-03-17     21

In [47]:
# create new columns and parse specific information

df["year"] = df["date"].dt.year
df["month"] = df["date"].dt.month
df["day"] = df["date"].dt.day
df["weekday"] = df["date"].dt.weekday
df["quarter"] = df["date"].dt.quarter
# 
# 
df["day_name"] = df["date"].dt.day_name()
df["month_name"] = df["date"].dt.month_name()




df.head()

        date  score  year  month  day  weekday  quarter   day_name month_name
0 2023-03-15     30  2023      3   15        2        1  Wednesday      March
1 2023-03-16     35  2023      3   16        3        1   Thursday      March
2 2023-03-17     21  2023      3   17        4        1     Friday      March

In [48]:
day_mapping = {
    0: "Montag",
    1: "Dienstag", 
    2: "Mittwoch",
    3: "Donnerstag",
    4: "Freitag",
    5: "Samstag", 
    6: "Sonntag"
}


df["day_of_week_de"] = df["date"].dt.day_of_week.map(day_mapping)

df.head()

,date,score,year,month,day,weekday,quarter,day_name,month_name,day_of_week_de
0,2023-03-15,30,2023,3,15,2,1,Wednesday,March,Mittwoch
1,2023-03-16,35,2023,3,16,3,1,Thursday,March,Donnerstag
2,2023-03-17,21,2023,3,17,4,1,Friday,March,Freitag

# Datetime functions

In [53]:
df["date"].min()
df["date"].max()
df["date"].mean()
df["date"].median()

Timestamp('2023-03-16 00:00:00')

In [54]:
# Search for certain records between two dates
df["date"].between("2023-03-10" , "2023-03-16")

df [df["date"].between("2023-03-10" , "2023-03-16")]

,date,score,year,month,day,weekday,quarter,day_name,month_name,day_of_week_de
0,2023-03-15,30,2023,3,15,2,1,Wednesday,March,Mittwoch
1,2023-03-16,35,2023,3,16,3,1,Thursday,March,Donnerstag